cases/MM/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (snow air);

snow
{
    transportModel  slurry;

    d               1.2e-4;
    rho             917.0;
}

air
{
    transportModel  Newtonian;

    nu              1.5e-05;
    rho             1.205;
}

relativeVelocityModel algebraic;

algebraicCoeffs
{
    residualRe 1e-4;
}

"(simple|general)Coeffs"
{
    V0              (0 0 -0.25);
    a               0;
    a1              0;
    residualAlpha   0;
}

// ************************************************************************* //
