cases/MM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale       1;

L           10;
W           1;
H           10;

nx          10;
ny          1;
nz          80;

x0          0;
x1          #eval{ $x0 + $L };

y0          0;
y1          #eval{ $y0 + $W };

z0          0;
z1          #eval{ $z0 + $H };

vertices
(
    ($x0 $y0 $z0)  //  0
    ($x1 $y0 $z0)  //  1
    ($x1 $y1 $z0)  //  2
    ($x0 $y1 $z0)  //  3

    ($x0 $y0 $z1)  //  4
    ($x1 $y0 $z1)  //  5
    ($x1 $y1 $z1)  //  6
    ($x0 $y1 $z1)  //  7
);

edges
(
);

blocks
(
    //hex ( 0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 ((0.01 0.1 6)(0.99 0.9 10)))
    hex ( 0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 64.41918)
);

boundary
(
    top
    {
        type    patch;
        faces
        (
            (4 5 6 7)
        );
    }

    bottom.snow
    {
        type    wall;
        faces
        (
            (0 1 2 3)
        );
    }

    sides
    {
        type    empty;
        faces
        (
            // minY
            (0 1 5 4)

            // maxY
            (2 3 7 6)
        );
    }

    inlet
    {
        type    cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type    cyclic;
        neighbourPatch inlet;
        faces
        (
            (1 2 6 5)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
