cases/MM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Make sure all utilities know specialised models
libs                (atmosphericModels);

application         driftFluxFoamPlus;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             15000;

deltaT              0.1;

writeControl        timeStep;

writeInterval       5000;

purgeWrite          10;

writeFormat         ascii;

writePrecision      12;

writeCompression    off;

timeFormat          general;

timePrecision       6;

runTimeModifiable   no;

functions
{
    #include "sample"
}


// ************************************************************************* //
