cases/MM/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    default                 none;

    div(rhoPhi,U)           Gauss linearUpwind grad(U);

    div(tauDm)              Gauss linear;
    div(U)                  Gauss linear;

    "div\(phi,alpha.*\)"                Gauss vanLeer01;
    div(interpolate(Udm),alpha.snow)    Gauss vanLeer01;
    "div\(phirb,alpha.*\)"              Gauss vanLeer01;

    div(rhoPhi,k)           Gauss limitedLinear 1;
    div(rhoPhi,epsilon)     Gauss limitedLinear 1;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear uncorrected;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             uncorrected;
}

wallDist
{
    method              meshWave;
}


// ************************************************************************* //
