cases/MM/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr          1;
        nAlphaSubCycles     1;

        MULESCorr           no;
        nLimiterIter        1;
        alphaApplyPrevCorr  no;

        solver              PBiCGStab;
        preconditioner      DILU;
        tolerance           1e-12;
        relTol              0;
        minIter             1;
    }

    p_rgh
    {
        solver              GAMG;
        smoother            DIC;
        tolerance           1e-12;
        relTol              0.01;
        //smoother          GaussSeidel;
        //nCellsInCoarsestLevel 20;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol              0;
    }

    "(U|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0.01;
        minIter         1;
    }

    "(U|k|epsilon)Final"
    {
        $k;
        relTol          0;
    }
}

PIMPLE
{
    correctPhi                  no;
    momentumPredictor           no;
    nOuterCorrectors            1;
    nCorrectors                 1;
    nNonOrthogonalCorrectors    0;
}

relaxationFactors
{
    equations
    {
        ".*"                    1;
    }
}


// ************************************************************************* //
